export const raid_analysis_constant = {
    enable_mapId: [669, 670],
    buffTable: {
        // 25人普通冷龙峰
        669: {
            17200: 8, // 精神匮乏，记录减疗超过40%的玩家
            17201: 8, // 耐力损耗，记录易伤超过40%的玩家
            27878: 3, // 风起潮涌
            28295: 3, // 狂躁的诺布心诀内力
            27922: 3, // 烈毒
            27940: 1, // 死寂
            27938: 4, // 悚然
            27939: 1, // 光耀炫目
            28267: 1, // 影秽
        },
        // 25人英雄冷龙峰
        670: {
            17200: 8, // 精神匮乏，记录减疗超过40%的玩家
            17201: 8, // 耐力损耗，记录易伤超过40%的玩家
            27878: 3, // 风起潮涌
            28295: 1, // 狂躁的诺布心诀内力
            27922: 3, // 烈毒
            27940: 1, // 死寂
            27937: 1, // 阴火弹
            27938: 4, // 悚然
            27939: 1, // 光耀炫目
            28267: 1, // 影秽
        },
    },
    buff2name: {
        17200: "精神匮乏",
        17201: "耐力损耗",
        27278: "风起潮涌",
        28295: "狂暴的诺布心决内力",
        27922: "烈毒",
        27940: "死寂",
        27938: "悚然",
        27939: "光耀炫目",
        27937: "阴火弹灼烧",
        28267: "影秽",
    },
    bossName: {
        669: [
            "葛木寒",
            "戮夜游·刀盾兵",
            "戮夜游·锁链手",
            "戮夜游·弓箭手",
            "雨轻红",
            "喜雅",
            "鹰眼客",
            "赤幽明",
            "赤厄明",
            "游荡黑影",
        ],

        670: [
            "葛木寒",
            "戮夜游·刀盾兵",
            "戮夜游·锁链手",
            "戮夜游·弓箭手",
            "雨轻红",
            "喜雅",
            "鹰眼客",
            "赤幽明",
            "赤厄明",
            "游荡黑影",
            "灵蝶",
        ],
    },

    noChannel_skillId: {
        669: [37498, 37075, 37002],
        670: [37498, 37075, 37002],
    },

    templateTable: {
        669: {
            127357: "戮夜游·锁链手",
            127369: "戮夜游·刀盾兵",
            127348: "落冰",
            126934: "黑镜",
            127310: "漆黑泥沼",
            123781: "游荡黑影",
        },
        670: {
            127460: "戮夜游·锁链手",
            127464: "戮夜游·刀盾兵",
            127442: "落冰",
            126934: "黑镜",
            127434: "漆黑泥沼",
            127476: "游荡黑影",
        },
    },
};
